DDL, DML, and DQL are three categories of SQL commands, differing mainly in what they do with the database: structure changes (DDL), data changes (DML), and data retrieval (DQL).

DDL (Data Definition Language)
DDL commands define or change the structure of database objects like tables, indexes, and schemas.
They typically auto-commit, meaning changes to structure are permanent once executed.

Common operations: CREATE, ALTER, DROP, TRUNCATE

CREATE TABLE Students (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT
);

DML (Data Manipulation Language)
DML commands manipulate the data stored inside tables.
They insert, update, or delete rows and are usually transactional (can be rolled back if the DB supports transactions).

Common operations: INSERT, UPDATE, DELETE, MERGE

INSERT INTO Students (id, name, age)
VALUES (1, 'Rahul', 22);

DQL (Data Query Language)
DQL commands are used to query/read data from the database without changing it.
In practice, DQL is mostly represented by the SELECT statement and its clauses.

Main operation: SELECT

SELECT name, age
FROM Students
WHERE age > 20;

Constraints limit the type of data that can be stored in tables, ensuring accuracy, reliability, and adherence to business logic. They act at the database level to catch issues early, reducing errors in applications and improving query performance through optimized storage.

Primary Key Constraint
This constraint uniquely identifies each row in a table by combining NOT NULL and UNIQUE properties. It prevents duplicate or null values in the specified column(s).

Scenario: In an "Employees" table, use PRIMARY KEY (emp_id) to ensure every employee has a unique ID, avoiding confusion when tracking payroll or HR records.

Foreign Key Constraint
This links a column in one table to the primary key of another, enforcing referential integrity between related tables.

Scenario: In an "Orders" table, FOREIGN KEY (customer_id) REFERENCES Customers(customer_id) ensures orders only reference valid existing customers, preventing orphaned order records.

CHECK Constraint
This evaluates a Boolean condition on column values, allowing only data that satisfies the rule.

Scenario: In a "Products" table, CHECK (price > 0) stops negative prices from being entered, maintaining realistic inventory pricing during stock updates.

LIMIT restricts the number of rows returned by a query, while OFFSET skips a specified number of rows before starting to return results. Together, they enable pagination by controlling which subset of ordered data to retrieve.
LIMIT Clause
This clause limits the result set to a maximum number of rows, improving performance for large tables.
It follows the ORDER BY clause and is essential for displaying manageable data chunks.
Example: SELECT * FROM users ORDER BY id LIMIT 5; returns the first 5 users.
OFFSET Clause
OFFSET skips the initial rows in the ordered result set, typically used with LIMIT for paging.
It requires an ORDER BY to ensure consistent skipping across queries.
Example: SELECT * FROM users ORDER BY id LIMIT 5 OFFSET 10; skips the first 10 rows and returns the next 5.
Using LIMIT and OFFSET for Pagination
For the third page with 10 records per page, skip the first 20 rows (pages 1 and 2).
The query becomes: SELECT * FROM users ORDER BY id LIMIT 10 OFFSET 20;.
This returns rows 21-30, assuming stable ordering by id

A Common Table Expression (CTE) in SQL is a temporary named result set defined within a single query using the WITH clause, allowing reuse of that subquery's logic in the main statement.

Main Benefits
CTEs improve query readability by breaking complex logic into modular, self-documenting blocks, much like breaking a long function into smaller ones. They enable reuse of intermediate results without repeating subqueries and support recursive operations for hierarchical data like org charts

WITH HighEarners AS (
    SELECT name, salary
    FROM Employees
    WHERE salary > 50000
)
SELECT name
FROM HighEarners
WHERE salary > 75000;

SQL Normalization organizes relational databases to minimize redundancy and dependency issues by structuring data into progressively stricter normal forms.

Primary Goals
Normalization eliminates data duplication, prevents anomalies during inserts, updates, or deletes, and ensures data integrity through proper dependencies. It promotes efficient storage and flexible querying by decomposing tables logically.
â€‹

First Normal Form (1NF)
1NF requires atomic values in each column (no repeating groups or arrays) and a primary key to uniquely identify rows.
Tables must eliminate multi-valued attributes, ensuring each cell holds a single value.
Example: Split a denormalized table with comma-separated phone numbers into separate rows per phone.

Second Normal Form (2NF)
2NF builds on 1NF by ensuring no partial dependencies: non-key attributes fully depend on the entire primary key, not just part of it.
This applies mainly to composite keys, removing attributes dependent on only one key column.
Example: In an Orders table with (order_id, product_id, product_name), move product_name to a Products table since it depends only on product_id.

Third Normal Form (3NF)
3NF extends 2NF by eliminating transitive dependencies: non-key attributes depend only on the primary key, not on other non-keys.
This prevents indirect relationships that could cause update anomalies.
Example: In Employees (emp_id, dept_id, dept_name), move dept_name to a Departments table to avoid repeating it per employee.

-- Create database (if not exists)
CREATE DATABASE IF NOT EXISTS ECommerceDB;
USE ECommerceDB;
DROP TABLE IF EXISTS Orders;
DROP TABLE IF EXISTS Products, Customers;
DROP TABLE IF EXISTS Categories;
CREATE TABLE Categories (
    CategoryID INT PRIMARY KEY,
    CategoryName VARCHAR(50) NOT NULL UNIQUE
);

CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100) NOT NULL UNIQUE,
    CategoryID INT,
    Price DECIMAL(10,2) NOT NULL,
    StockQuantity INT,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100) NOT NULL,
    Email VARCHAR(100) UNIQUE,
    JoinDate DATE
);

CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10,2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);
INSERT INTO Categories (CategoryID, CategoryName) VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');

INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel : The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);

INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');

INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);

SELECT * FROM Categories;
SELECT * FROM Products;
SELECT * FROM Customers;
SELECT * FROM Orders;

SELECT
    c.CustomerName,
    c.Email,
    COALESCE(COUNT(o.OrderID), 0) AS TotalNumberofOrders
FROM Customers c
LEFT JOIN Orders o ON c.CustomerID = o.CustomerID
GROUP BY c.CustomerID, c.CustomerName, c.Email
ORDER BY c.CustomerName;

SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM Products p
INNER JOIN Categories c ON p.CategoryID = c.CategoryID
ORDER BY c.CategoryName, p.ProductName;

WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        ROW_NUMBER() OVER (
            PARTITION BY c.CategoryID
            ORDER BY p.Price DESC
        ) as rn
    FROM Products p
    INNER JOIN Categories c ON p.CategoryID = c.CategoryID
)
SELECT
    CategoryName,
    ProductName,
    Price
FROM RankedProducts
WHERE rn <= 2
ORDER BY CategoryName, Price DESC;

SELECT
    CONCAT(c.first_name, ' ', c.last_name) AS CustomerName,
    c.email,
    SUM(p.amount) AS TotalSpent
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
JOIN payment p ON r.rental_id = p.rental_id
GROUP BY c.customer_id, c.first_name, c.last_name, c.email
ORDER BY TotalSpent DESC
LIMIT 5;

SELECT
    cat.name AS CategoryName,
    COUNT(r.rental_id) AS RentalCount
FROM category cat
JOIN film_category fc ON cat.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY cat.category_id, cat.name
ORDER BY RentalCount DESC
LIMIT 3;

SELECT
    s.store_id,
    COUNT(i.inventory_id) AS TotalFilmsAvailable,
    COUNT(DISTINCT CASE WHEN r.rental_id IS NULL THEN i.inventory_id END) AS NeverRented
FROM store s
LEFT JOIN inventory i ON s.store_id = i.store_id
LEFT JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY s.store_id
ORDER BY s.store_id;

SELECT
    DATE_FORMAT(p.payment_date, '%Y-%m') AS Month,
    SUM(p.amount) AS TotalRevenue
FROM payment p
WHERE YEAR(p.payment_date) = 2023
GROUP BY DATE_FORMAT(p.payment_date, '%Y-%m')
ORDER BY Month;

SELECT
    CONCAT(c.first_name, ' ', c.last_name) AS CustomerName,
    c.email,
    COUNT(r.rental_id) AS RentalCount
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
WHERE r.rental_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH)
GROUP BY c.customer_id, c.first_name, c.last_name, c.email
HAVING RentalCount > 10
ORDER BY RentalCount DESC;